backend: theano
class_name: Model
config:
  input_layers:
  - [input_7, 0, 0]
  - [input_8, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 100]
      dtype: float32
      name: input_7
      sparse: false
    inbound_nodes: []
    name: input_7
  - class_name: Embedding
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 100]
      dtype: float32
      embeddings_constraint: null
      embeddings_initializer:
        class_name: RandomUniform
        config: {maxval: 0.05, minval: -0.05, seed: null}
      embeddings_regularizer: null
      input_dim: 81940
      input_length: 100
      mask_zero: false
      name: embedding_4
      output_dim: 300
      trainable: false
    inbound_nodes:
    - - - input_7
        - 0
        - 0
        - {}
    name: embedding_4
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dilation_rate: !!python/tuple [1]
      filters: 100
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [2]
      name: conv1d_10
      padding: same
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - embedding_4
        - 0
        - 0
        - {}
    name: conv1d_10
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dilation_rate: !!python/tuple [1]
      filters: 100
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3]
      name: conv1d_11
      padding: same
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - embedding_4
        - 0
        - 0
        - {}
    name: conv1d_11
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dilation_rate: !!python/tuple [1]
      filters: 100
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4]
      name: conv1d_12
      padding: same
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - embedding_4
        - 0
        - 0
        - {}
    name: conv1d_12
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_7, trainable: true}
    inbound_nodes:
    - - - conv1d_10
        - 0
        - 0
        - &id001 {}
      - - conv1d_11
        - 0
        - 0
        - *id001
      - - conv1d_12
        - 0
        - 0
        - *id001
    name: concatenate_7
  - class_name: MaxPooling1D
    config:
      name: max_pooling1d_4
      padding: valid
      pool_size: !!python/tuple [4]
      strides: !!python/tuple [4]
      trainable: true
    inbound_nodes:
    - - - concatenate_7
        - 0
        - 0
        - {}
    name: max_pooling1d_4
  - class_name: Flatten
    config: {name: flatten_4, trainable: true}
    inbound_nodes:
    - - - max_pooling1d_4
        - 0
        - 0
        - {}
    name: flatten_4
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 44]
      dtype: float32
      name: input_8
      sparse: false
    inbound_nodes: []
    name: input_8
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_8, trainable: true}
    inbound_nodes:
    - - - flatten_4
        - 0
        - 0
        - &id002 {}
      - - input_8
        - 0
        - 0
        - *id002
    name: concatenate_8
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_8
      trainable: true
      units: 6
      use_bias: true
    inbound_nodes:
    - - - concatenate_8
        - 0
        - 0
        - {}
    name: dense_8
  name: model_4
  output_layers:
  - [dense_8, 0, 0]
keras_version: 2.0.9
